/*Вычислить и вывести на экран значения выражений без
манипулятора boolalpha и с этим манипулятором (разобраться
почему результаты вывода на экран в некоторых случаях
различаются или совпадают):
• ((6 % 3 == 1) == (0 == 1));
• ((2 != 2*3*4) && (2 != 24));
• ((5 / 2 >= 5) || (2 >= 5));
• ((8 % 3 == 1) == (2 == 1));
• ((2 != 1*1*2) == (!2 != 2));
• 5 % 2 ? 2 : 3;
• (7 % 6 ? 0 : 1).*/
#include <iostream>
#include <iomanip>
#include <cmath>
using namespace std;

int main(){

    cout<<"без boolalpha";

    cout<<((6 % 3 == 1) == (0 == 1))<<"\n";
    cout<<((2 != 2*3*4) && (2 != 24))<<"\n";
    cout<<((5 / 2 >= 5) || (2 >= 5))<<"\n";
    cout<<((8 % 3 == 1) == (2 == 1))<<"\n";
    cout<<((2 != 1*1*2) == (!2 != 2))<<"\n";
    cout<<(5 % 2 ? 2 : 3)<<"\n";
    cout<<(7 % 6 ? 0 : 1)<<"\n";

    cout<<"\n";

    cout<<"с boolalpha\n";

    cout<<boolalpha;

    cout<<((6 % 3 == 1) == (0 == 1))<<"\n";
    cout<<((2 != 2*3*4) && (2 != 24))<<"\n";
    cout<<((5 / 2 >= 5) || (2 >= 5))<<"\n";
    cout<<((8 % 3 == 1) == (2 == 1))<<"\n";
    cout<<((2 != 1*1*2) == (!2 != 2))<<"\n";
    cout<<(5 % 2 ? 2 : 3)<<"\n";
    cout<<(7 % 6 ? 0 : 1)<<"\n";

    return 0;
}